&НаСервере
Процедура ПередЗаписьюНаСервере()
	Для Каждого Строка Из Объект.Выплаты Цикл
		Запись = ЭтотОбъект.РегистрыНакопления.ВзаиморасчетыССотрудниками.Добавить();
		Запись.Сотрудник = Строка.Сотрудник;
		Запись.Сумма = Строка.Сумма;
		Запись.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Выплаты.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не обнаружены данные сотрудников для проведения выплат зарплат!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	//@skip-check invocation-form-event-handler
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАвтозаполнение()
	Сотрудник = Справочники.Пользователи.Выбрать();
	Пока Сотрудник.Следующий() Цикл
		СуммаВыплаты = 0;
		Удержание = 0;
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДополнительныеНачисления.Начисление КАК Доп,
			|	ОсновныеНачисления.Начисление КАК Осн,
			|	Удержания.Удержано КАК Удер
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления,
			|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления,
			|	РегистрРасчета.Удержания КАК Удержания
			|ГДЕ
			|	ДополнительныеНачисления.Сотрудник = &Сотрудник
			|	И ОсновныеНачисления.Сотрудник = &Сотрудник
			|	И Удержания.Сотрудник = &Сотрудник
			|	И ДополнительныеНачисления.Дата = &Дата
			|	И ОсновныеНачисления.Дата = &Дата
			|	И Месяц(Удержания.Дата) = &Дата";
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник.ПолучитьОбъект());
		Запрос.УстановитьПараметр("Дата", Месяц(Объект.Дата));
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СуммаВыплаты = СуммаВыплаты + ВыборкаДетальныеЗаписи.Доп;
			СуммаВыплаты = СуммаВыплаты + ВыборкаДетальныеЗаписи.Осн;
			Удержание = Удержание + ВыборкаДетальныеЗаписи.Удер;
		КонецЦикла;
		Если СуммаВыплаты > 0 Тогда
			НоваяСтрока = Объект.Выплаты.Добавить();
			НоваяСтрока.Сотрудник = Сотрудник.ПолучитьОбъект();
			НоваяСтрока.Сумма = СуммаВыплаты - Удержание;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не определена дата формирования расчетов с сотрудниками!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ВыполнитьАвтозаполнение();
КонецПроцедуры
