
&НаСервере
Процедура ПередЗаписьюНаСервере()
	Для Каждого Строка Из Объект.СписокСотрудников Цикл
		НачислениеПремии = РегистрыРасчета.ДополнительныеНачисления.Добавить();
		НачислениеПремии.Сотрудник = Строка.Сотрудник;
		СуммаУдержания = Строка.СуммаПремии * (Константы.НДФЛ.Получить() / 100);
		НачислениеПремии.Начисление = СуммаУдержания;
		НачислениеПремии.Дата = ТекущаяДата();
		НачислениеПремии.Провести();
		
		НовоеУдержание = РегистрыРасчета.Удержания.Добавить();
		НовоеУдержание.Сотрудник = Строка.Сотрудник;
		НовоеУдержание.Удержано = СуммаУдержания;
		НовоеУдержание.ТипУдержания = "НДФЛ от начисления премии";
		НовоеУдержание.Дата = ТекущаяДата();
		НовоеУдержание.Провести();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого Строка Из Объект.СписокСотрудников Цикл
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Обнаружена строка с незаполненным полем 'Сотрудник'!";
			Сообщение.Сообщить();
			Возврат;
		Иначе Если Не ЗначениеЗаполнено(Строка.СуммаПремии) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Обнаружена строка с незаполненным полем 'Сумма премии'!";
			Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//@skip-check invocation-form-event-handler
	ПередЗаписьюНаСервере();
КонецПроцедуры
