#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Функция ВыполнитьАвтозаполнение(Договор) Экспорт
	
	Таблица = Услуги.Выгрузить();
	
	Договор1 = Договор.ПолучитьОбъект();
	Если Договор1.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов_Новый.АбонентскоеОбслуживание Тогда		
		Если Не ЗначениеЗаполнено(Константы.НоменклатураАбонентскаяПлата.Получить()) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Значение константы НоменклатураАбонентскаяПлата не заполнено!";
			Сообщение.Сообщить();
		Иначе Если Не ЗначениеЗаполнено(Константы.НоменклатураРаботыСпециалиста.Получить())
			Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Значение константы НоменклатураРаботыСпециалиста не заполнено";
				Сообщение.Сообщить();
			Иначе
				Таблица.Очистить();			        
			    Если Договор1.СуммаЕжемесячнойАбонентскойПлаты > 0 Тогда
			        НоваяСтрока = Таблица.Добавить();
			        НоваяСтрока.Номенклатура = Константы.НоменклатураАбонентскаяПлата.Получить();
			        НоваяСтрока.Цена = Договор1.СуммаЕжемесячнойАбонентскойПлаты;
			        НоваяСтрока.Количество = 1;
			        НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
			    КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ВыполненныеКлиентуРаботы.ВидДвижения
				|ИЗ
				|	РегистрНакопления.ВыполненныеКлиентуРаботы КАК ВыполненныеКлиентуРаботы
				|ГДЕ
				|	Месяц(ВыполненныеКлиентуРаботы.Период) = &Месяц
				|	И ВыполненныеКлиентуРаботы.Договор.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", Договор1.Наименование);
			Запрос.УстановитьПараметр("Месяц", Месяц(Дата));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Номенклатура = Константы.НоменклатураРаботыСпециалиста.Получить();
				НоваяСтрока.Количество = РегистрыНакопления.ВыполненныеКлиентуРаботы.Выбрать().КоличествоЧасов;
				НоваяСтрока.Сумма = РегистрыНакопления.ВыполненныеКлиентуРаботы.Выбрать().СуммаКОплате;
				НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
			КонецЕсли;
			Возврат Таблица;
		КонецЕсли;
	КонецЕсли;
	Иначе
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Выбранный договор не является абонентской платой";
		 Сообщение.Сообщить();
	КонецЕсли;
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли

