
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
        //@skip-check undefined-variable
        Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов_Новый.АбонентскоеОбслуживание Тогда
		// Показать новые реквизиты
        Элементы.ДатаНачалаДействияДоговора.Visible = Истина;
        Элементы.ДатаОкончанияДействияДоговора.Visible = Истина;
        Элементы.СуммаЕжемесячнойАбонентскойПлаты.Visible = Истина;
        Элементы.СтоимостьЧасаРаботыСпециалиста.Visible = Истина;
    Иначе
        // Скрыть новые реквизиты
        Элементы.ДатаНачалаДействияДоговора.Visible = Ложь;
        Элементы.ДатаОкончанияДействияДоговора.Visible = Ложь;
        Элементы.СуммаЕжемесячнойАбонентскойПлаты.Visible = Ложь;
        Элементы.СтоимостьЧасаРаботыСпециалиста.Visible = Ложь;
    КонецЕсли;
КонецПроцедуры
