&НаКлиенте
Процедура ЗапуститьФормуАнализаГрафика(Команда)
	ОткрытьФорму(ЭтотОбъект.Документы.ГрафикОтпусков.АнализГрафика);
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	Для Каждого Строка Из Элемент Цикл
		Если ЗначениеЗаполнено(Строка.ДатаОкончания) И ЗначениеЗаполнено(Строка.ДатаНачала) 
		И (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24) < 28 Тогда
			Строка.ЦветФона = Новый Цвет(255, 77, 0); 
		Иначе
			Строка.ЦветФона = Новый Цвет(255, 255, 255); 
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
