
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов_Новый.АбонентскоеОбслуживание Тогда
        Сообщить("Выберите договор с типом 'Абонентское обслуживание'.");
        Возврат;
    КонецЕсли;
    
    Если ДатаПроведенияРабот < Договор.ДатаНачалаДействияДоговора Или ДатаПроведенияРабот > Договор.ДатаОкончанияДействияДоговора Тогда
        Сообщить("Дата документа должна быть в пределах действия договора.");
        Возврат;
    КонецЕсли;
	
	Движения.ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	ТаблицаДляПроведения = ВыполненныеРаботы.Выгрузить();
	ТаблицаДляПроведения.Свернуть("ОписаниеРабот", "ЧасыКОплатеКлиенту");

	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов_Новый.АбонентскоеОбслуживание;

	Для Каждого ТекСтрокаАбонОбсл Из ВыполненныеРаботы Цикл

		Если ТекСтрокаАбонОбсл.ОписаниеРабот = ВидДоговора Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаАбонОбсл.ЧасыКОплатеКлиенту; 
		Движение.СуммаКОплате = Договор.СтоимостьЧасаРаботыСпециалиста*ТекСтрокаАбонОбсл.ЧасыКОплатеКлиенту;
КонецЦикла;
КонецПроцедуры
