&НаСервере
Процедура ПолучитьСписокДоговоровНаСервере()
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Или Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Отсутствует диапазон выборки договоров обслуживания клиентов!";
		Сообщение.Сообщить();
	Иначе
		МесяцНачало = Месяц(Объект.НачалоПериода);
		МесяцКонец = Месяц(Объект.КонецПериода);
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Наименование КАК Договор
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	Месяц(ДоговорыКонтрагентов.ДатаНачалаДействияДоговора) >= &МесяцНачало
			|	Месяц(И ДоговорыКонтрагентов.ДатаОкончанияДействияДоговора) <= &МесяцКонец";
		
		Запрос.УстановитьПараметр("МесяцНачало", МесяцНачало);
		Запрос.УстановитьПараметр("МесяцКонец", МесяцКонец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Строка = Объект.ТабличнаяЧасть.Добавить();
			Строка.Договор = Выборка.Договор;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокДоговоров(Команда)
	ПолучитьСписокДоговоровНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьИЗакрытьНаСервере()
	Если Объект.ТабличнаяЧасть.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Отсутствуют выбранные договора в указанном диапазоне!";
		Сообщение.Сообщить();
	Иначе
		МесяцНачало = Месяц(Объект.НачалоПериода);
		МесяцКонец = Месяц(Объект.КонецПериода);
		
		Для Каждого СтрокаТаблицы Из Объект.ТабличнаяЧасть.Выгрузить() Цикл
			НаличиеРеализации = Ложь;
					
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	Месяц(РеализацияТоваровУслуг.Дата) = &МесяцНачала
				|   И Месяц(РеализацияТоваровУслуг.Дата) = &МесяцКонца
				|	И РеализацияТоваровУслуг.Договор.Наименование = &Наименование";
					
			Запрос.УстановитьПараметр("МесяцНачала", МесяцНачало);
			Запрос.УстановитьПараметр("МесяцКонца", МесяцКонец);
			Запрос.УстановитьПараметр("Наименование", СтрокаТаблицы.Договор);
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НаличиеРеализации = Истина;
				Прервать;
			КонецЦикла;
			
			Если Не НаличиеРеализации = Ложь Тогда
				//не знаю как делать
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИЗакрыть(Команда)
	СформироватьИЗакрытьНаСервере();
КонецПроцедуры
